; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v1)
		(pred_2 ?v5)
		(pred_5 ?v3)
		(pred_1 ?v3)
		(pred_4 ?v5 ?v3)
		(pred_6)
		(pred_3 ?v5))

   (:action op_3
       :parameters  (?v4 ?v7)
       :precondition (and (not-eq ?v4 ?v7) 
                          (pred_5 ?v4) (pred_5 ?v7) (pred_1 ?v4))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v4))))


   (:action op_1
       :parameters (?v2 ?v8)
       :precondition  (and  (pred_2 ?v2) (pred_5 ?v8)
			    (pred_4 ?v2 ?v8) (pred_1 ?v8) (pred_6))
       :effect (and (pred_3 ?v2)
		    (not (pred_4 ?v2 ?v8)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v2  ?v8)
       :precondition  (and  (pred_2 ?v2) (pred_5 ?v8)
			    (pred_3 ?v2) (pred_1 ?v8))
       :effect (and (pred_4 ?v2 ?v8)
		    (pred_6)
		    (not (pred_3 ?v2)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_01 obj_02 obj_03 
          obj_04 obj_05 obj_06 
)
(:init
(pred_5 obj_01)
(pred_5 obj_02)
(pred_5 obj_03)
(pred_2 obj_04)
(pred_2 obj_05)
(pred_2 obj_06)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(pred_6)
(pred_4 obj_04 obj_01)
(pred_4 obj_05 obj_02)
(pred_4 obj_06 obj_02)
(pred_1 obj_01)
)
(:goal
(and
(pred_4 obj_04 obj_02)
(pred_4 obj_05 obj_01)
(pred_4 obj_06 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_04 obj_02) (pred_1 obj_03))
    (sometime-before  (pred_4 obj_05 obj_01) (pred_1 obj_03))
    (sometime-before  (pred_4 obj_06 obj_01) (pred_1 obj_03))
  )
)
)

; plan
1. (op_1 obj_04 obj_01)
   deleted: (pred_4 obj_04 obj_01) (pred_6)
   added: (pred_3 obj_04)
   goals met: 0 of 3
2. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 0 of 3
3. (op_2 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_4 obj_04 obj_03) (pred_6)
   goals met: 0 of 3
4. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 0 of 3
5. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06 obj_02) (pred_6)
   added: (pred_3 obj_06)
   goals met: 0 of 3
6. (op_3 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 0 of 3
7. (op_2 obj_06 obj_01)
   deleted: (pred_3 obj_06)
   added: (pred_4 obj_06 obj_01) (pred_6)
   goals met: 1 of 3
8. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 3
9. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05 obj_02) (pred_6)
   added: (pred_3 obj_05)
   goals met: 1 of 3
10. (op_3 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 1 of 3
11. (op_2 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05 obj_01) (pred_6)
   goals met: 2 of 3
12. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 2 of 3
13. (op_1 obj_04 obj_03)
   deleted: (pred_4 obj_04 obj_03) (pred_6)
   added: (pred_3 obj_04)
   goals met: 2 of 3
14. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 2 of 3
15. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_4 obj_04 obj_02) (pred_6)
   goals met: 3 of 3
